import * as React from 'react';
import './Body.css';
import Topimg from './Topimg';

import Infoimage from './infoimage';
import Infoboxes from './Infoboxes';
import Infotext from './Infotext';

import aboutus from '../media/navimg.webp'
import boximg1 from '../media/infobox1_1.png'
import boximg2 from '../media/infobox1_2.png'
import boximg3 from '../media/infobox1_3.png'
import boximg2_1 from '../media/infobox2_1.png'
import boximg2_2 from '../media/infobox2_2.png'
import boximg2_3 from '../media/infobox2_3.png'
import adoptme from '../media/adoptme.jpg'
function Body() {
  
  return (
    <div className="body">
        <Topimg img={aboutus} heading='Про Нас'/>
        <Infotext heading='Починаючи з 2022 року, ми допомагаєм усім бездомним котикам яким тільки можем.'
        info='Ми допомагаємо сотням котів і кошенят на рік через нашу національну мережу, яка включає кілька волонтерських відділень та 5 центрів. Однак наша робота на цьому не зупиняється: ми також надаємо низку інформації щодо догляду за котами через наші публікації, допомогу та консультаційний відділ; популяризуєм переваги стерилізації, щоб запобігти народженню небажаних потомств які стануть вже затра стануть покинутими, а також з радістю навчаєм людей будь-якого віку як правильно доглядати за котами'/>
        <Infoboxes img1={boximg1} head1='Команда' par1='Наша команда активістів виступає на захист котів і проводить кампанії за зміни по всій Україні.'
         img2={boximg2} head2='Підготовка' par2='Ми підготовлюєм майбутніх власників котів за допомогою наших безкоштовних бесід, уроків, інтерактивних заходів і цікавих відео.'
         img3={boximg3} head3='Стерилізація' par3='Ми відстоюємо стерилізацію як єдиний ефективний спосіб зменшити кількість небажаних котів у світі, а також це має низку переваг для здоров’я.'/>
         <Infoimage img = {adoptme} head='Нова домівка' par='Ми кожного року допомагаєм сотням котикам через мережу наших центів, даючи їм ще один шанс на теплу домівку. Хочете допомогти? Зконтактуйтеся з нами↑↑↑' />
         <Infoboxes img1={boximg2_1} head1='Горе і втрата' par1='Якщо у вас розбите серце через втрату свого кота, або вам потрібен хтось, щоб поговорити, ми тут, щоб дати пораду та вислухати вас.'
         img2={boximg2_2} head2='Lifeline' par2='Наша служба Lifeline забезпечує притулок для домашніх тварин від тих, хто перебуває в притулку до ситуацій з побиттям їхніми господарями'
         img3={boximg2_3} head3='Котячі опікуни' par3='Котячі опікуни — це наша послуга, спрямована на те, щоб заспокоїти власників котів, які стурбовані тим, що може статися, якщо вони помруть раніше свого кота.'/>
         
    </div>
  );
}

export default Body;
